Update Github repository URL, Blog content, Fix Diagrams.
